package de.zimmermann.lesson_02;

public class Aufgabe02 {
    public static void main(String[] args) {
        /*
        Создайте переменную message типа String и присвойте ей значение "Привет, мир!".
         Затем измените значение message на "Привет, Java!"
         и выведите это значение на консоль.
         */

        //Создание переменной message типа String и приcваивание ей значения
        String message = "Привет, мир! ";
        System.out.println(message);


        //Изменение значения переменной на "Привет, Java!"
        message = "Привет, Java!";

        System.out.println(message);


    }
}
